WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetDuration_Client_Request-10.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetDuration</a:Action>
    <a:MessageID>urn:uuid:5599460a-ea6c-4ded-9202-1e73701351c1</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDuration xmlns="http://tempuri.org/">
      <inTimeSpan xmlns="">-P10675199DT2H48M5.4775808S</inTimeSpan>
    </RetDuration>
  </s:Body>
</s:Envelope>